#include <stdio.h>

int main(int argc, char *argv[])
{
	//定义时同时赋值,叫做初始化
	int b = 10;

	//1.数组的初始化需要{},只有在定义是才能初始化
	int a1[10] = {1,2,3,4,5,6,7,8,9,10};

	int a2[10];

	//数组名不是变量,是常量,常量不能修改
	//a2 = {1,2,3,4,5,6,7,8,9,10};	//err

	//a2 = 1;	//err
	
	//2.部分初始化数组,其他自动初始化为0
	//0~2个元素分别初始化为1,2,3,其他元素初始化为0
	int a3[] = {1,2,3};

	//3.数组全部元素初始化为0
	int a4 = {0};

	//4.如果定义时同时初始化,第一个[]内部可以不写内容
	//编译器会根据用户初始化的元素来确定数组大小
	int a5[] = {1,2,3,4,5,6,7,8,9,10};

	//5.如果第一个[]内容不写,必须初始化,否则语法错误
	//int a6[];	//err
	
	
	return 0;
}
