/*
 * 第二章:选择器
 * 基本规则:
 *		1.规则结构:选择器 + 声明块;
 *		2.声明块: 若干个声明组成;
 *		3.声明: 属性 + 值;
 *
 * 选择器:
 *		1.元素选择器
 *		2.通配选择器
 *		3.类选择器
 *		4.ID选择器
 *		5.属性选择器
 *			5.1.部分选择值选择器
 *			5.2.特定属性选择器
 *		6.后代选择器
 *			6.1.选择子元素
 *			6.2.选择相邻兄弟元素
 *		7.伪类选择器
 *		8.伪元素选择器
 *
 *
 *	第三章:结构和层叠
 *  特殊性:
 *		1.结合符合通配符对特殊性没有任何贡献
 *  继承:
 *		1.一般的,大多数框模型属性(外边距,内边距,背景和边框)都不能继承,究其原因是,如果可以继承,页面就会显得很乱.
 *		2.继承的值根本没有特殊性,甚至连0特殊性都没有.
 *		3.通配符选择器能匹配任何元素,所以通配符选择器往往有一种短路继承的效果.
 *  层叠:
 *		总结在声明权重方面要考虑5级:
 *		1.读者的重要声明.
 *		2.创作人员的重要声明
 *		3.创作人员的正常声明
 *		4.读者的正常声明
 *		5.用户代理声明
 *
 *	第四章:值和单位
 *		值:
 *			1.数字
 *			2.百分数:
 *		单位:
 *			1.颜色
 *			2.长度单位
 *				1.1.绝对长度单位
 *				1.2.相对长度单位
 *			3.url
 *			4.css2单位
 *
 *
 *
 *
*/
