/*
 * 1.早饭要吃的丰盛些，午饭要吃的饱些，晚饭则吃的清淡些少量些。
 * 俗话说，早上吃的像皇帝，中午吃的像百姓，晚上吃的像乞丐。
 * 维持低油、低盐的饮食习惯。尽量以蒸或煮的方式来烹调，以减少油脂摄取。
 * 如果是在外面用餐，可要一杯白开水将菜稍微过一下，选掉多余的油分与盐分。
 * 多摄取高纤维的食物。如芹菜、香菇、青菜、水果、豆类、薯类等食物，都含有丰富的纤维，每天都应摄取（但不要太油）。
 * 纤维能帮助油脂的吸附
 *
 * 健康的生活习惯和行为,国际总结方针:合理膳食,适量运动,戒烟限酒,心理平衡
 *
 * 2.下班唱京剧,一天的脑力疲劳劳动没有了,兴奋灶转移了,这样晚上工作效率大大提高.
 *	拉力器方便携带,锻炼身体
 *
 * 3.怎么吃饭?
 * 10个网球的原则:
 *		1.1个网球的肉
 *		2.2个网球的主食
 *		3.3个网球的水果(水果作为每顿饭的必备食物)
 *		4.4个网球的蔬菜(随便吃)
 *
 * 4.怎么运动锻炼?
 *		1.锻炼每周超过3次,每次超过半小时,锻炼强度相当于快走.
 * 
 * 5.人衰老的最主要原因是肌肉流失.肌纤维是每个人固定的,如果不刻意锻炼,会逐年丢失.负重锻炼是保住肌肉最好的方法.
 *
 * 6.习惯如何养成:
 *		1.坚持三个星期,初步形成习惯.
 *		2.三个月,稳定的习惯.
 *		3.半年,牢固的习惯.
 */
