#include <stdio.h>

//有参无返回值定义:
//1.定义函数的参数叫形参,形参的格式必须为:类型+变量,不能赋值
//void fun1(int a = 10){};		//err
//2.函数没有调用,形参变量不会分配空间,函数调用完毕,形参变量自动释放

void fun1(int a){

	printf("a = %d\n", a);
}

void fun2(int a, char ch, char buf[]){
	//如果形参有多个,用逗号","隔开
	printf("a = %d, ch = %c, buf = %s\n", a,ch,buf);
	
}

int main(int argc, char *argv[])
{

	//有参无返回值函数的调用
	//1.如果函数定义的是有参数,调用时必须传参
	//fun()		//err
	//2.有参函数调用形式:函数名字(匹配类型参数)
	//3.匹配类型参数可以是常量,变量,表达式
	//4.函数调用时传的参数叫实参
	//5.只能把实参传递给形参,不能反过来,单向传递
	
	fun1(10);	//实参是常量

	int i = 10;

	fun1(i);	//实参是变量

	fun1(1 > 2);	//实参是表达式

	//6.函数的形参有多个,传参也用都好","分开
	fun2(10,'a',"abc");

	
	return 0;
}
